# Question 3 Part 1
- Use ‘cricket_matches’ data set
- Calculate the average score for each team which host the game and win the game
- Remember that if a team hosts a game and wins the game, their score can be innings_1 runs or innings_2 runs. You have to check if the host team won the game, check which innings they played in (innings_1 or innings_2), and take the runs scored in that innings. The final answer is the average score of each team satisfying the above condition
- Display a few rows of the output use df.head()
- Generate a csv output

In [1]:
import pandas as pd

In [5]:
# maintain rows where hosts win
raw_df = pd.read_csv('Data/cricket_matches.csv')
raw_df = raw_df[raw_df['home'] == raw_df['winner']]
raw_df.head(2)

,match_details,result,scores,date,venue,round,home,away,winner,win_by_runs,...,innings1_wickets,innings1_overs_batted,innings1_overs,innings2,innings2_runs,innings2_wickets,innings2_overs_batted,innings2_overs,D/L_method,target
0,North Group:Durham v Nottinghamshire at Cheste...,Durham won by 6 wickets (with 5 balls remaining),Nottinghamshire 157/7 (20/20 ov); Durham 160/4...,13/06/2003,Chester-le-Street,North Group,Durham,Nottinghamshire,Durham,NaN,...,7.0,20.0,20.0,Durham,160.0,4.0,19.1,20.0,NaN,NaN
1,South Group:Hampshire v Sussex at Southampton-...,Hampshire won by 5 runs,Hampshire 153 (19.4/20 ov); Sussex 148/7 (20/2...,13/06/2003,Southampton,South Group,Hampshire,Sussex,Hampshire,5.0,...,10.0,19.4,20.0,Sussex,148.0,7.0,20.0,20.0,NaN,NaN

In [19]:
# drop unnecessary columns
col_list = ['home', 'innings1' , 'innings2', 'innings1_runs', 'innings2_runs']
cut_df = raw_df[col_list]
cut_df.head(4)

,home,innings1,innings2,innings1_runs,innings2_runs
0,Durham,Nottinghamshire,Durham,157.0,160.0
1,Hampshire,Hampshire,Sussex,153.0,148.0
3,Surrey,Middlesex,Surrey,155.0,158.0
4,Worcestershire,Northamptonshire,Worcestershire,150.0,151.0

In [20]:
# decide which innings runs should we get
def choose_col(row):
    if row['home'] == row['innings1']:
        return row['innings1_runs']
    else:
        return row['innings2_runs']

In [21]:
# drop NaNs and add Score column
# new_df.info()
cut_df['Score'] = cut_df.apply(choose_col, axis=1)
cut_df.head(4)

,home,innings1,innings2,innings1_runs,innings2_runs,Score
0,Durham,Nottinghamshire,Durham,157.0,160.0,160.0
1,Hampshire,Hampshire,Sussex,153.0,148.0,153.0
3,Surrey,Middlesex,Surrey,155.0,158.0,158.0
4,Worcestershire,Northamptonshire,Worcestershire,150.0,151.0,151.0

In [22]:
# drop unnecessary columns
col_list = ['home', 'Score']
new_df= cut_df[col_list]
new_df.head(3)

        home  Score
0     Durham  160.0
1  Hampshire  153.0
3     Surrey  158.0

In [23]:
# get average scores of each team
out_df = new_df.groupby(['home'], as_index=False).mean()
out_df.head(4)

                 home       Score
0     Abahani Limited  172.000000
1  Abbottabad Falcons  139.454545
2   Abbottabad Region  182.666667
3   Abbottabad Rhinos  165.000000

In [24]:
out_df.to_csv('output_csv/q3p1_output.csv',index=False,header=True)